# SetAngle

## Description
Set angle of the passed object.

```pascal
PROCEDURE SetAngle(
				h     : HANDLE;
				value : REAL);
```

```python
def vs.SetAngle(h, value):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to object.|
|value|REAL|The new rotation angle of the object. Angle in degrees (-180;180] measured from (1,0) vector.|

## Version
Availability: from Vectorworks14.0

## Category
* Object Info